{"cover_image":"../media/blog-social-intro.png","title":"Idea<img class=\"emoji\" draggable=\"false\" alt=\"💡\" src=\"https://cdnjs.cloudflare.com/ajax/libs/twemoji/14.0.2/svg/1f4a1.svg\"/>: LighteningCSS for Rollup, Vite, ESBuild, but with a twist...","date":"2023-02-28T18:30:00.000Z","description":"Incorporate lighteningCSS into tools like Rollup, Vite, ESBuild.","body":"<p><em>Vite is an awesome, awesome tool for minification and bundling. It's fast, it's easy to use, and it's got a great community. But, it's not the only tool out there. There are other tools like Rollup, ESBuild, and more. And, they all have their own advantages and disadvantages. But, they all have one thing in common: they don't have a LighteningCSS plugin.</em></p>\n<p>What you read above is generated by Github Copilot. I can rest assure you that rest of the article is written by a human, and you're reading a person's authentic thoughts. This disclaimer is presented to you in recent light of tools like ChatGPT popping up, and people being confused about whether or not the text they're reading is generated by a machine or a human. So be rest assured, this article is 1000% written by a human.</p>\n<p>So, with that out of the way, let's get into the article.</p>\n<h1 id=\"The-problem:-Processing-CSS-is-hard\"><a class=\"heading-link\" href=\"#The-problem:-Processing-CSS-is-hard\">#</a>The problem: Processing CSS is hard</h1>\n<p>What I mean by processing: Bundling CSS using bundlers like Rollup, ESBuild, Vite etc, and it includes SASS/LESS/SCSS transpiling, CSS Modules, Code Splitting, Minification etc. Most of these problems right now are solved literally in Vite's core code.</p>\n<p>Yes, Vite is the best CSS processor of any bundler I have seen until now. It has so many goodies:</p>\n<ul>\n<li><code>@import</code> Inlining and Rebasing</li>\n<li>PostCSS</li>\n<li>CSS Modules</li>\n<li>CSS Pre-processors (SASS/SCSS, LESS, STYLUS)</li>\n<li>Minification</li>\n<li>Inlining</li>\n</ul>\n<p>The last feature(Inlining) is not specific to CSS, but to Vite. But, this feature is what lead to my research into CSS processing for rollup. More on that later.</p>\n<h2 id=\"A-missing-piece\"><a class=\"heading-link\" href=\"#A-missing-piece\">#</a>A missing piece</h2>\n<p>Vite's CSS processing is really good. However, it can be better: At the time of writing, Vite is using ESBuild for minification and some of the CSS processing, combined with PostCSS. ESBuild is a great tool, but it's not the best tool for minification. It's not the best tool for CSS processing. And, that's where LighteningCSS comes in.</p>\n<h2 id=\"LighteningCSS\"><a class=\"heading-link\" href=\"#LighteningCSS\">#</a>LighteningCSS</h2>\n","id":"proposal-vite-style-lighteningcss-plugin","reading_time":0.83,"toc":[{"indent":0,"id":"The-problem:-Processing-CSS-is-hard","title":"The problem: Processing CSS is hard","length":35},{"indent":1,"id":"A-missing-piece","title":"A missing piece","length":15},{"indent":1,"id":"LighteningCSS","title":"LighteningCSS","length":13}],"seriesIndex":0}